####################################
############## CLIS ################
####################################
### Development tools ###
brew "neovim" # Editor
brew "tmux" # Terminal multiplexer
brew "git" # Distributed revision control system
brew "lazygit" # Simple terminal UI for git commands

### http ###
brew "httpie" # User-friendly cURL replacement (command-line HTTP client)

### kubernetes ###
brew "kubernetes-cli" # Kubernetes command-line interface

### Manager ###
brew "asdf" # Tool to manage multiple language runtimes with plugin support
brew "pnpm" # Fast, disk space efficient package manager

### iOS ###
brew "xcodes", link: false # Best command-line tool to install and switch between multiple versions of Xcode

### Java build tool ###
brew "gradle" # Flexible build tool for JVM languages and other platforms

### Cloud ###
# brew "awscli" # Command-line tools to manage resources and services on AWS

### Others ###
brew "fd" # Simple, fast and user-friendly alternative to find
brew "fzf" # Fuzzy find/search
brew "ripgrep" # Search tool like grep and The Silver Searcher
brew "sops" # Editor of encrypted files
brew "watchman" # Watch files and take action when they change
brew "bat" # Similar to cat command, it's a cat clone with syntax highlighting and Git integration, etc.
brew "chafa" # Terminal image preview
brew "font-hack-nerd-font" # Fonts


####################################
############## Casks ###############
####################################
### Browsers ###
cask "google-chrome"
cask "firefox"
cask "brave-browser"
cask "microsoft-edge"

### iOS ###
cask "xcodes" # Install and switch between multiple versions of Xcode

### Android ###
cask "android-studio" # Tools for building Android applications

### Database ###
cask "dbeaver-community" # Administration and development platform for database

### Cooperation ###
cask "discord" # Voice and text chat software
cask "notion" # App to write, plan, collaborate, and get organised

### Terminal ###
cask "iterm2" # Terminal emulator as alternative to Apple's Terminal app

### Docker ###
# cask "docker" # Platform to build, share, and run containerized applications and microservices
cask "orbstack" # Lightweight alternative to Docker Desktop for managing containers and VMs on macOS

### Cloud ###
cask "google-cloud-sdk" # Set of tools to manage resources and applications hosted on Google Cloud
