####################################
############## Taps ################
####################################
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

####################################
############## CLIS ################
####################################
### Development tools ###
brew "neovim" # Editor
brew "tmux" # Terminal multiplexer
brew "git" # Distributed revision control system
brew "lazygit" # Simple terminal UI for git commands

### http ###
brew "httpie" # User-friendly cURL replacement (command-line HTTP client)

### kubernetes ###
brew "kubernetes-cli" # Kubernetes command-line interface

### Manager ###
brew "asdf"
brew "pnpm" # Fast, disk space efficient package manager

### Dependencies ###
brew "libpq" # Postgres C API library
brew "coreutils" # GNU File, Shell, and Text utilities

### Others ###
brew "fd" # Simple, fast and user-friendly alternative to find
brew "ripgrep" # Search tool like grep and The Silver Searcher
brew "sops" # Editor of encrypted files
brew "watchman" # Watch files and take action when they change
brew "xcodes", link: false # Best command-line tool to install and switch between multiple versions of Xcode

####################################
############## Casks ###############
####################################
### Browser ###
cask "brave-browser"
cask "google-chrome"
cask "firefox"
cask "microsoft-edge"

### Android ###
cask "android-studio" # Tools for building Android applications
cask "zulu11" # OpenJDK distribution from Azul

### Database ###
cask "pgadmin4" # Administration and development platform for PostgreSQL

### Cooperation ###
cask "discord" # Voice and text chat software
cask "notion" # App to write, plan, collaborate, and get organised

### Terminal ###
cask "iterm2" # Terminal emulator as alternative to Apple's Terminal app

### Docker ###
cask "docker" # App to build and share containerised applications and microservices

### Others ###
cask "google-cloud-sdk" # Set of tools to manage resources and applications hosted on Google Cloud

cask "ngrok" # Reverse proxy, secure introspectable tunnels to localhost

cask "xcodes" # Install and switch between multiple versions of Xcode

### Fonts ##
cask "font-hack-nerd-font"
